############## Brew 2020 ##############

###### core tools ######
rcm			# see https://github.com/thoughtbot/rcmpwgen
wget
tmux
byobu

###### osx tools ######
lunchy		# see https://github.com/eddiezane/lunchy
afsctool	# apfs compression
mas			# mac app store tool
duti		# Select default apps for documents and URL schemes on macOS
tag			# Manipulate and query tags on macOS files https://github.com/jdberry/tag/
osxutils	# see https://github.com/specious/osxutils

###### system tools ######
smartmontools


###### other stuff ######
buku                    # bookmark manager https://github.com/jarun/Buku

###### txt search tools ######
ack 					# see https://beyondgrep.com/
the_silver_searcher		# see https://github.com/ggreer/the_silver_searcher
ripgrep					# see https://github.com/BurntSushi/ripgrep
jq						# see https://github.com/stedolan/jq
fzf						# general-purpose interactive command-line fuzzy finder https://github.com/junegunn/fzf
fd						# find alternative		https://github.com/sharkdp/fd




###### other utilities ######
pigz		# multithreaded zip
p7zip		# 7zip cli
tree
htop


#### fonts 
# Usage:
#     $ brew tap homebrew/cask-fonts                  # you only have to do this once!
#     $ brew cask install font-inconsolata

font-roboto-mono					# dependancy: svn
font-roboto-mono-for-powerline
font-menlo-for-powerline
font-source-code-pro
font-source-code-pro-for-powerline	# dependancy: svn



########### more shell goodies ############
starship	# minimal, blazing-fast shell prompt in rust https://github.com/starship/starship
			# dep: nerd font

## see https://dev.to/_darrenburns/10-tools-to-power-up-your-command-line-4id4

z			# bash dir jump 		https://github.com/rupa/z
autojump	# dir jump 				https://github.com/wting/autojump
bat			# syntax highlighting 	https://github.com/sharkdp/bat
exa			# ls alternative
asciinema	# record terminal actions as animations https://asciinema.org/
			# dependancy: python 3.8
			# and then use 'svg-term' (npm) to convert to SVG  https://github.com/marionebl/svg-term-cli


###### cheatsheets ######
cheat					# now in golang					https://github.com/cheat/cheat
navi					# https://github.com/denisidoro/navi

## tldr: Collaborative cheatsheets for console commands https://github.com/tldr-pages/tldr
#isacikgoz/taps/tldr		# interactive tldr in golang 	https://github.com/isacikgoz/tldr
tealdeer				# tldr in rust 					https://github.com/dbrgn/tealdeer




################## devel #################
direnv					# see https://github.com/direnv/direnv
dnsmasq					# for faking pow.cx
dive					# inspect docker layers

puma/puma/puma-dev		# pow.cx alternative https://github.com/puma/puma-dev
node
kotlin

rbenv					# see https://github.com/rbenv/rbenv
pyenv					# see https://github.com/pyenv/pyenv
nodeenv
n
asdf

#### deploy
ansible
salt					# dep: python, zeromq


#### node tools
pnpm
yarn
bower

### static gen
hugo
eleventy

#### other tools
bench					# code benchmarking tool in haskell		https://github.com/Gabriel439/bench
hyperfine				# code benchmarking tool in rust 		https://github.com/sharkdp/hyperfine

#wrk					# benchmarking your HTTP APIs			https://github.com/wg/wrk
						# also https://github.com/giltene/wrk2
						# A constant throughput, correct latency recording variant of wrk






##### git tools
gh			# Official Github CLI https://cli.github.com/
hub			# see https://hub.github.com/
# gist
# git-crypt
git-extras
git-flow
git-url-sub
# gitsh
legit		# see https://frostming.github.io/legit/
            # undo, sync might conflict with git-extras
            # also: switch, publish, unpublish, branches

### manage git repos
repo		# manage multiple git repos https://gerrit.googlesource.com/git-repo/
mr		# last updated in 2018. Use 'repo' instead https://myrepos.branchable.com/
#ghq			# centralized cloned repos https://github.com/x-motemen/ghq

## also 'gita' in pip3. see https://github.com/nosarthur/gita



######### not used #########
antibody		# see https://github.com/getantibody/antibody
# antigen		# see https://github.com/zsh-users/antigen # SLOW
chruby
ruby-install







######### more #########

# notmuch
# unrar
# todo-txt
# doing
# gnupg2
# gpg-agent
# pinentry-mac


# android-platform-tools
# appswitch  # DEAD formula, see https://github.com/nriley/appswitch/
# xapian
# go


# brew-cask
# brew-desc # DEAD
# brew-gem  # Installs gems to Cellar, see https://github.com/sportngin/brew-gem
# brew-pip	# see https://github.com/hanxue/brew-pip




########### notes ###########


# ==> Caveats
# ==> sqlite
# sqlite is keg-only, which means it was not symlinked into /Users/goofrider/.brew,
# because macOS already provides this software and installing another version in
# parallel can cause all kinds of trouble.
#
# If you need to have sqlite first in your PATH run:
#   echo 'export PATH="/Users/goofrider/.brew/opt/sqlite/bin:$PATH"' >> ~/.zshrc
#
# For compilers to find sqlite you may need to set:
#   export LDFLAGS="-L/Users/goofrider/.brew/opt/sqlite/lib"
#   export CPPFLAGS="-I/Users/goofrider/.brew/opt/sqlite/include"
#
# For pkg-config to find sqlite you may need to set:
#   export PKG_CONFIG_PATH="/Users/goofrider/.brew/opt/sqlite/lib/pkgconfig"
#
# ==> python@3.8
# Python has been installed as
#   /Users/goofrider/.brew/bin/python3
#
# Unversioned symlinks `python`, `python-config`, `pip` etc. pointing to
# `python3`, `python3-config`, `pip3` etc., respectively, have been installed into
#   /Users/goofrider/.brew/opt/python@3.8/libexec/bin
#
# You can install Python packages with
#   pip3 install <package>
# They will install into the site-package directory
#   /Users/goofrider/.brew/lib/python3.8/site-packages
#
# See: https://docs.brew.sh/Homebrew-and-Python




############## brew-list 2018 ##############

# android-platform-tools
# gitbucket
# gnupg2
# go
# gpg-agent
# jsvc
# logstash
# mysql-connector-c
# notmuch
# osxutils
# platypus
# pyside
# pyside-tools
# qt
# redis
# tinyproxy
# todo-txt
# tree
# unrar
# xapian
# xz







